Revit 2027 API
DividedSurface.IsComponentMirrored Property
Whether the pattern is mirror-imaged.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsComponentMirrored { get; set; }
Public Property IsComponentMirrored As Boolean
	Get
	Set
public:
property bool IsComponentMirrored {
	bool get ();
	void set (bool value);
}
member IsComponentMirrored : bool with get, set
Property Value
Boolean
Remarks
This property has no effect unless a pattern is selected (the ObjectType property is not null). Changing this flag effectively reflects the component through its YZ-plane.
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace